Kouteimaster.delete_all
Kouteimaster.reset_pk_sequence

Kouteimaster.create!([
                         {所属コード:"1", 工程コード:"01", 工程名:'販路開拓'},
                         {所属コード:"1", 工程コード:"02", 工程名:'引合対応'},
                         {所属コード:"1", 工程コード:"03", 工程名:'見積使用'},
                         {所属コード:"1", 工程コード:"88", 工程名:'生販会議'},
                         {所属コード:"1", 工程コード:"99", 工程名:'営業部門業務改善'},
                         {所属コード:"2", 工程コード:"01", 工程名:'概要設計'},
                         {所属コード:"2", 工程コード:"02", 工程名:'詳細設計'},
                         {所属コード:"2", 工程コード:"03", 工程名:'IF設計'},
                         {所属コード:"2", 工程コード:"04", 工程名:'移行設計'},
                         {所属コード:"2", 工程コード:"05", 工程名:'PG設計'},
                         {所属コード:"2", 工程コード:"06", 工程名:'PG製作'},
                         {所属コード:"2", 工程コード:"07", 工程名:'テスト仕様'},
                         {所属コード:"2", 工程コード:"08", 工程名:'システムテスト'},
                         {所属コード:"2", 工程コード:"09", 工程名:'ユニットテスト'},
                         {所属コード:"2", 工程コード:"10", 工程名:'本番立会'},
                         {所属コード:"2", 工程コード:"11", 工程名:'障害調査'},
                         {所属コード:"2", 工程コード:"88", 工程名:'生販会議'},
                         {所属コード:"2", 工程コード:"99", 工程名:'技術部門業務改善'},
                         {所属コード:"3", 工程コード:"01", 工程名:'財務・決算'},
                         {所属コード:"3", 工程コード:"02", 工程名:'売買'},
                         {所属コード:"3", 工程コード:"03", 工程名:'原価'},
                         {所属コード:"3", 工程コード:"04", 工程名:'総務'},
                         {所属コード:"3", 工程コード:"88", 工程名:'生販会議'},
                         {所属コード:"3", 工程コード:"99", 工程名:'管理部門業務改善'},
                         {所属コード:"4", 工程コード:"01", 工程名:'営業G管理指導'},
                         {所属コード:"4", 工程コード:"02", 工程名:'技術G管理指導'},
                         {所属コード:"4", 工程コード:"03", 工程名:'管理G管理指導'},
                         {所属コード:"4", 工程コード:"04", 工程名:'全社業務改善'},
                         {所属コード:"4", 工程コード:"05", 工程名:'会合・交際'}
                     ])