Bashomaster.delete_all
Bashomaster.reset_pk_sequence

Bashomaster.create!([
                        {場所コード:'1',    場所名:'本社',         場所名カナ:'ホンシャ',   SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {場所コード:'11',   場所名:'本社6F',       場所名カナ:'ホンシャ6F',   SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {場所コード:'12',   場所名:'本社7F',        場所名カナ:'ホンシャ7F',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'111',  場所名:'会議室6F',      場所名カナ:'カイギシツ6F',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'121',  場所名:'会議室7F',      場所名カナ:'カイギシツ7F',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'13',   場所名:'女子休憩室',     場所名カナ:'ジョシキュウケイシツ',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'14',   場所名:'喫煙室',        場所名カナ:'キツエンシツ',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'15',   場所名:'相談役室',      場所名カナ:'ソウダンヤクシツ',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'16',   場所名:'休憩室',        場所名カナ:'キュウケイシツ',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'17',   場所名:'サーバールーム', 場所名カナ:'サーバールーム',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'18',   場所名:'ジュピター電算機システム', 場所名カナ:'ジュピター電算機システム',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'19',   場所名:'不二製油', 場所名カナ:'不二製油',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'20',   場所名:'ケンコーマヨネーズ', 場所名カナ:'ケンコーマヨネーズ',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        { 場所コード:'21',   場所名:'日本ハム', 場所名カナ:'日本ハム',  SUB:'', 場所区分:'1', 会社コード:'999999' }
                    ])
