Bashomaster.delete_all
Bashomaster.reset_pk_sequence

Bashomaster.create!([
                        {社員番号:'0000000001', 場所コード:'1',    場所名:'本社',         場所名カナ:'ホンシャ',   SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {社員番号:'0000000002', 場所コード:'11',   場所名:'本社6F',       場所名カナ:'ホンシャ6F',   SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {社員番号:'0000000003', 場所コード:'12',   場所名:'本社7F',        場所名カナ:'ホンシャ7F',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {社員番号:'0000000004', 場所コード:'111',  場所名:'会議室6F',      場所名カナ:'カイギシツ6F',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {社員番号:'0000000005', 場所コード:'121',  場所名:'会議室7F',      場所名カナ:'カイギシツ7F',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {社員番号:'0000000006', 場所コード:'13',   場所名:'女子休憩室',     場所名カナ:'ジョシキュウケイシツ',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {社員番号:'0000000007', 場所コード:'14',   場所名:'喫煙室',        場所名カナ:'キツエンシツ',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {社員番号:'0000000008', 場所コード:'15',   場所名:'相談役室',      場所名カナ:'ソウダンヤクシツ',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {社員番号:'0000000009', 場所コード:'16',   場所名:'休憩室',        場所名カナ:'キュウケイシツ',  SUB:'', 場所区分:'1', 会社コード:'999999' },
                        {社員番号:'0000000010', 場所コード:'17',   場所名:'サーバールーム', 場所名カナ:'サーバールーム',  SUB:'', 場所区分:'1', 会社コード:'999999' }
                    ])
