Sagyou.delete_all
Sagyou.reset_pk_sequence
# Employer.delete_all

Sagyou.create!([
                   {作業場所コード:1, 作業場所名:'不在'},
                   {作業場所コード:1, 作業場所名:'本社６Ｆ '},
                   {作業場所コード:1, 作業場所名:'直行'},
                   {作業場所コード:1, 作業場所名:'外出'},
                   {作業場所コード:1, 作業場所名:'出張'},
                   {作業場所コード:1, 作業場所名:'出張移動'},
                   {作業場所コード:1, 作業場所名:'会議６Ｆ '},
                   {作業場所コード:1, 作業場所名:'会議７Ｆ '},
                   {作業場所コード:1, 作業場所名:'休暇'},
                   { 作業場所コード:1, 作業場所名:'私用外出'},
                   { 作業場所コード:1, 作業場所名:'来客'},
                   { 作業場所コード:1, 作業場所名:'早退'},
                   { 作業場所コード:1, 作業場所名:'特別休暇'},
                   { 作業場所コード:1, 作業場所名:'代休'},
                   { 作業場所コード:1, 作業場所名:'在宅勤務'},
                   { 作業場所コード:1, 作業場所名:'半休'},
                   { 作業場所コード:1, 作業場所名:'サーバ'},
                   { 作業場所コード:1, 作業場所名:'休日'},
                   { 作業場所コード:1, 作業場所名:'相談室'},
                   { 作業場所コード:1, 作業場所名:'フレックス'},
                   { 作業場所コード:1, 作業場所名:'帰宅'},
                   { 作業場所コード:1, 作業場所名:'本社７Ｆ '}
               ])

# Employer.create!([{first_name:'Duc', position: 'IT Engeener', office: 'Osaka', age: 35, start_date: 2015-03-02, salary:4000}])





